---
kind: property
id: P:Autodesk.Revit.DB.PointClouds.PointCollection.Count
source: html/61b5f249-53bb-2d21-e85b-2beebbe4ed05.htm
---
# Autodesk.Revit.DB.PointClouds.PointCollection.Count Property

The number of points in this collection.

## Syntax (C#)
```csharp
public int Count { get; }
```